In [1]:
import numpy as np
import pandas as pd

In [6]:
df1 = pd.DataFrame(np.random.randint(1,101,20).reshape(5,4),[10,20,30,40,50],['A', 'B', 'C', 'D'])

In [7]:
df1

     A   B   C    D
10  50  65  81  100
20  51  81  35   52
30  54   2  45   65
40   7  48  87   36
50  49  59  36   58

In [10]:
df1[df1['A']>30]

     A   B   C    D
10  50  65  81  100
20  51  81  35   52
30  54   2  45   65
50  49  59  36   58

In [12]:
df1[(df1['A']<50) | (df1['B']<40)]

     A   B   C   D
30  54   2  45  65
40   7  48  87  36
50  49  59  36  58

In [13]:
df1

     A   B   C    D
10  50  65  81  100
20  51  81  35   52
30  54   2  45   65
40   7  48  87   36
50  49  59  36   58

In [14]:
df1[(df1['C']>20) & (df1['D']<70)][['A','B']]

     A   B
20  51  81
30  54   2
40   7  48
50  49  59